#include <iostream>
using namespace std;

//행, 열, 그룹의 범위 1 ~ 9
//행은 9가 증가할때마다 1 증가
//열은 1이 증가할때마다 1 증가
//그룹은 3이 증가할때마다 1 증가

int row[82] = {	//스도쿠판의 행 배열
	0,
	1,1,1,1,1,1,1,1,1,
	2,2,2,2,2,2,2,2,2,
	3,3,3,3,3,3,3,3,3,
	4,4,4,4,4,4,4,4,4,
	5,5,5,5,5,5,5,5,5,
	6,6,6,6,6,6,6,6,6,
	7,7,7,7,7,7,7,7,7,
	8,8,8,8,8,8,8,8,8,
	9,9,9,9,9,9,9,9,9
};

int colums[82] = {	//스도쿠판의 열 배열
	0,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9,
	1,2,3,4,5,6,7,8,9
};

int group[82] = {	//스도쿠판의 그룹 배열
	0,
	1,1,1,2,2,2,3,3,3,
	1,1,1,2,2,2,3,3,3,
	1,1,1,2,2,2,3,3,3,
	4,4,4,5,5,5,6,6,6,
	4,4,4,5,5,5,6,6,6,
	4,4,4,5,5,5,6,6,6,
	7,7,7,8,8,8,9,9,9,
	7,7,7,8,8,8,9,9,9,
	7,7,7,8,8,8,9,9,9
};

int main()
{
	int T;	//테스트케이스의 변수
	cin >> T;	//테스트케이스 입력
	int* arrays = new int[T];	//테스트케이스의 수만큼 배열을 만들 수 있게한다.

	for (int i = 0; i < T; ++i)
	{
		cin >> arrays[i];	//1~81 숫자를 입력받는다.
	}

	for (int i = 0; i < T; ++i)
	{
		printf("Case #%d\n", i + 1);	//출력형식을 맞춘다.
		cout << row[arrays[i]] << " "	//만들어놓은 배열에 들어있는 값을 출력한다.
			<< colums[arrays[i]] << " "
			<< group[arrays[i]] << '\n';
	}
	delete[] arrays;	//힙메모리를 반환해준다.
	return 0;
}